mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
    if(esp8266_http_server.hasArg("iotype")){
      device.setType(esp8266_http_server.arg("iotype"));
    }

    if(esp8266_http_server.hasArg("iopin")){
      device.iopin = esp8266_http_server.arg("iopin").toInt();
    }
    if(esp8266_http_server.hasArg("io_default")){
      device.io_default = esp8266_http_server.arg("io_default").toInt();
    }
    if(esp8266_http_server.hasArg("inverted")){
      device.setInverted(esp8266_http_server.arg("inverted"));
    }

    SetDevice(index, device);

    sucess &= bufferInsert("device: " + esp8266_http_server.arg("device") + "\n");

    // Force reconnect to MQTT so we subscribe to any new addresses.
    mqtt->forceDisconnect();
    io->setup();
  }
  

  Serial.println(buffer);

  Serial.println("onSet() -");
  if(sucess){
    //Persist_Data::Persistent<Config> persist_config(config);
    //persist_config.writeConfig();
    config->save();
  }
  esp8266_http_server.send((sucess ? 200 : 500), "text/plain", buffer);
}

void HttpServer::onReset() {
  Serial.println("restarting host");
  delay(100);
  ESP.reset();

  esp8266_http_server.send(200, "text/plain", "restarting host");
}

void HttpServer::bufferClear(){
  Serial.println("bufferClear");
  buffer[0] = '\0';
}

bool HttpServer::bufferAppend(const String& to_add){
  return bufferAppend(to_add.c_str());
}

bool HttpServer::bufferAppend(const char* to_add){
  strncat(buffer, to_add, buffer_size - strlen(buffer) -1);
  return ((buffer_size - strlen(buffer) -1) >= strlen(to_add));
}

bool HttpServer::bufferInsert(const String& to_insert){
  return bufferInsert(to_insert.c_str());
}

bool HttpServer::bufferInsert(const char* to_insert){
  if((buffer_size - strlen(buffer) -1) >= strlen(to_insert)){
    *(buffer + strlen(to_insert) + strlen(buffer)) = '\0';
    memmove(buffer + strlen(to_insert), buffer, strlen(buffer));
    memcpy(buffer, to_insert, strlen(to_insert));
    return true;
  }
  return false;
}

CompileMustache::CompileMustache(char* _buffer, 
                                 const int _buffer_size,
                                 Config* _config,
                                 MdnsLookup* _brokers,
                                 mdns::MDns* _mdns,
                                 Mqtt* _mqtt,
                                 Io* _io) :
  buffer(_buffer),  
  buffer_size(_buffer_size),
  config(_config),
  brokers(_brokers),
  mdns(_mdns),
  mqtt(_mqtt),
  io(_io),
  list_depth(0),
  list_parent()
{
  for(int i = 0; i < MAX_LIST_RECURSION; i++){
    list_element[i] = -1;
    list_size[i] = -1;
  }
  
  // Gets set false if buffer over-runs.
  success = true;
}

bool CompileMustache::myMemmove(char* destination, char* source, int len){
  if(!success){
    return false;
  }
  if(destination + len > buffer + buffer_size){
    Serial.println("Error: Exceeded buffer size.");
    len = buffer + buffer_size - destination;
    return false;
  }
  memmove(destination, source, len);
  return true;
}

void CompileMustache::parseBuffer(char* buffer_in, int buffer_in_len,
                                  char*& buffer_out, int& buffer_out_len,
                                  int& list_depth, bool& parsing_list)
{
  Serial.print("d  |");
  Serial.print(list_depth);
  Serial.print(" ");
  Serial.println((int)parsing_list);
  Serial.print("bi |");
  Serial.println(buffer_in);

  char tag[TAG_NAME_LEN];
  tagType type;

  char* buffer_tail = buffer_in;

  while(buffer_out && strlen(buffer_tail)){
    wdt_reset();
    char* tag_start = findPattern(buffer_tail, "{{",
        strnlen(buffer_tail, buffer_in + buffer_in_len - buffer_tail) -1);
    if(!tag_start && *(buffer_tail + strlen(buffer_tail) -1) == '{'){
      // Special case where last character is the start of a tag.
      tag_start = buffer_tail + strlen(buffer_tail) -1;
    }

    if(parsing_list){
      // In process of copying to separate list buffer.

      char* close_tag = findClosingTag(buffer_tail,
          buffer_in + buffer_in_len - buffer_tail,
          list_template[list_depth].tag);

      int len = 0;
      if(close_tag){
        len = close_tag - buffer_tail;
      } else {
        char* last_tag_start = tag_start;
        char* tmp_last_tag_start = tag_start;

        while(tmp_last_tag_start){
          tmp_last_tag_start =
            findPattern(tmp_last_tag_start +1, "{{", strnlen(tmp_last_tag_start +1, 
                        buffer_in + buffer_in_len - tmp_last_tag_start -1));
          if(tmp_last_tag_start){
            last_tag_start = tmp_last_tag_start;
          }
        }
        

        len = strlen(buffer_tail);
        if(last_tag_start && 
            !findPattern(last_tag_start +1, "}}", strnlen(last_tag_start +1,
                         buffer_in + buffer_in_len - tmp_last_tag_start -1)))
        {
          // The closing tag overlaps buffer boundary.
          len = last_tag_start - buffer_tail;
        }
      }

      int len_buff_space =
          list_template[list_depth].buffer_len - strlen(list_template[list_depth].buffer) -1;
      if(len > len_buff_space){
        // Only enough space in output buffer for content before {{tag}}.
        list_template[list_depth].buffer_len += len;
        list_template[list_depth].buffer =
          (char*)realloc((void*)list_template[list_depth].buffer,
          list_template[list_depth].buffer_len);
        if(!list_template[list_depth].buffer){
          Serial.println("ERROR: Failed realloc()");
          parsing_list = false;
          break;
        }
      }

      strncat(list_template[list_depth].buffer, buffer_tail, len);

      Serial.print("bt |");
      Serial.println(list_template[list_depth].buffer);

      if(!close_tag){
        Serial.println(len);
        Serial.println(strlen(buffer_tail));
        if(len == strlen(buffer_tail)){
          // Whole buffer is added to list_template[list_depth].buffer.
          buffer_tail = buffer_in;
          buffer_tail[0] = '\0';
        } else {
          buffer_tail += len;
        }

        break;
      }

      char tag_content[128];
      int itterator = 0;
      int element_count = 0;
      replaceTag2(tag_content, itterator, element_count,
                  list_template[list_depth].tag, tagList, 128, list_depth);
      Serial.print("ec |");
      Serial.println(element_count);

      Serial.print("+");
      Serial.print(list_depth);
      Serial.println("~~~~~~~~~~~~~~~~~~~");

      if(list_template[list_depth].inverted){
        element_count = !bool(element_count);
      }
      int tmp_element_count;
      for(int i = 0; i < element_count; i++){
        replaceTag2(tag_content, itterator, tmp_element_count,
                    list_template[list_depth].tag, tagListItem, 128, list_depth);

