mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
        int tmp_buffer_in_len = list_template[list_depth].buffer_len;
        char* tmp_buffer_in = (char*)malloc(tmp_buffer_in_len);
        memcpy(tmp_buffer_in, list_template[list_depth].buffer, tmp_buffer_in_len);
        bool parsing_list_inner = false;
        parseBuffer(tmp_buffer_in, tmp_buffer_in_len,
                    buffer_out, buffer_out_len, list_depth, parsing_list_inner);
        free(tmp_buffer_in);
      }
      Serial.print("-");
      Serial.print(list_depth);
      Serial.println("~~~~~~~~~~~~~~~~~~~");

      buffer_tail = close_tag + strlen(list_template[list_depth].tag) + strlen("{{/}}");
      
      free(list_template[list_depth].buffer);
      list_template[list_depth].buffer = NULL;
      list_template[list_depth].buffer_len = 0;
      exitList(list_parent);
      list_depth--;
      parsing_list = false;
        
    } else if(tag_start && tagName(tag_start, tag, type)){
      // {{tag}} found.
      Serial.println(1);

      int len_to_tag = tag_start - buffer_tail;
      int len_buff_space = buffer_out_len - strlen(buffer_out) -1;
      if(len_to_tag > len_buff_space){
        // Only enough space in output buffer for content before {{tag}}.
        buffer_out_len += len_to_tag + TAG_NAME_LEN;
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
        if(!buffer_out){
          Serial.println("ERROR: Failed realloc()");
          break;
        }
      }

      strncat(buffer_out, buffer_tail, len_to_tag);
      len_buff_space -= len_to_tag;

      Serial.print("tag: ");
      Serial.print(tag);
      Serial.print(" ");
      Serial.println((int)type);

      char tag_content[128];
      int itterator = 0;
      int element_count = 0;
      replaceTag2(tag_content, itterator, element_count, tag, type, 128, list_depth);

      if(type == tagPlain){
        Serial.println(1.1);
        if(strlen(tag_content) > len_buff_space){
          buffer_out_len += strlen(tag_content);
          buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
        }
        strncat(buffer_out, tag_content, len_buff_space);
        buffer_tail += len_to_tag + strnlen(tag, 128) + strlen("{{}}");
      } else if(type == tagList || type == tagInverted){
        Serial.println(1.2);

        parsing_list = true;
        list_depth++;
        enterList(list_parent, tag);

        Serial.print("d  |");
        Serial.println(list_depth);

        strncpy(list_template[list_depth].tag, tag, TAG_NAME_LEN);
        list_template[list_depth].inverted = (type == tagInverted);
        list_template[list_depth].buffer = (char*)malloc(1);
        list_template[list_depth].buffer_len = 1;
        list_template[list_depth].buffer[0] = '\0';
        buffer_tail = tag_start + strlen(tag) + strlen("{{#}}");
      }
    } else if(tag_start &&
        tag_start >= (buffer_in + buffer_in_len - TAG_NAME_LEN - strlen("{{#}}")))
    {
      // File content with no {{tag}} followed by a {{tag}} near the end.
      // Since the {{tag}} is possibly not completely in the buffer_in, only
      // process everything up to {{tag}}.
      Serial.println(2);
      if(tag_start - buffer_tail <= 0){
        // All data worth sending has been added to buffer_out.
        break;
      }
      if(tag_start - buffer_tail > buffer_out_len - strlen(buffer_out) -1){
        buffer_out_len += tag_start - buffer_tail;
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
      }
      strncat(buffer_out, buffer_tail, tag_start - buffer_tail);
      buffer_tail += tag_start - buffer_tail;
    } else {
      // No {{tag}} in buffer_in. Copy everything to buffer_out.
      Serial.println(4);
      if(strlen(buffer_tail) > buffer_out_len - strlen(buffer_out) -1){
        buffer_out_len += strlen(buffer_tail);
        buffer_out = (char*)realloc((void*)buffer_out, buffer_out_len);
      }
      strncat(buffer_out, buffer_tail, strlen(buffer_tail));
      buffer_tail += strlen(buffer_tail);
    }
  }

  memmove(buffer_in, buffer_tail, strlen(buffer_tail) +1);

  /*Serial.print("d  |");
  Serial.print(list_depth);
  Serial.print(" ");
  Serial.println((int)parsing_list);
  Serial.print("bo |");
  Serial.println(buffer_out);*/
}

char* CompileMustache::findClosingTag(char* buffer_in, const int buffer_in_len,
                                      const char* tag)
{
  char full_tag[TAG_NAME_LEN + strlen("{{/}}") +1];
  full_tag[0] = '\0';
  strcat(full_tag, "{{/");
  strcat(full_tag, tag);
  strcat(full_tag, "}}");
  //Serial.print("ct |");
  //Serial.println(full_tag);
  return findPattern(buffer_in, full_tag, buffer_in_len);
}


bool CompileMustache::tagName(char* tag_start, char* tag, tagType& type){
  type = tagUnset;
  if(!tag_start || tag_start[0] != '{' || tag_start[1] != '{'){
    return false;
  }
  tag_start += 2;

  for(int i = 0; i < TAG_NAME_LEN; i++){
    // Skip through any "{{" deliminators and whitespace to start of tag name.
    if(*tag_start >= '!' and *tag_start <= 'z' and
        *tag_start != '#' and *tag_start != '^'){
      break;
    }
    switch(*tag_start)
    {
      case '#':
        if(type != tagUnset) {return false;}
        type = tagList;
        break;
      case '^':
        if(type != tagUnset) {return false;}
        type = tagInverted;
        break;
    }

    tag_start ++;
  }
  if(type == tagUnset){
    type = tagPlain;
  }

  if(findPattern(tag_start, "}}", TAG_NAME_LEN)){
    strncpy(tag, tag_start, TAG_NAME_LEN);
    char* end_pattern = findPattern(tag, "}}", TAG_NAME_LEN);
    if(end_pattern){
      *end_pattern = '\0';
      while(strlen(tag)){
        if(tag[strlen(tag)] == ' '){
          // Remove trailing whitespace.
          tag[strlen(tag)] = '\0';
        } else {
          break;
        }
      }
      return true;
    }
    // empty string.
    tag[0] = '\0';
  }
  return false;
}

bool CompileMustache::duplicateList(char* tag_start_buf, const char* tag, const int number){
  if(!success){
    Serial.println("ERROR: Previous failure.");
    return false;
  }

